{ "blogposts": [{
  "author": "Chuck Norris",
  "title": "Chuck faces the boogeyman",
  "content": "A young, unstable man hacks to death the lady and man he lives with, and Texan Sheriff Dan Stevens comes face to face with the killer, to only see him gunned down by his men after he tries to escape when captured. At the hospital, he's pronounced dead, but secretly he's used in an experiment by some surgeons working on a formula to help the body genetically heal in quick succession. They thought they could control him and this development would bring them success, but now this homicidal murderer is an unstoppable killing machine and Sheriff Stevens and his rookie Deputy are on the trail. Norris' fans might dig it, but others might find this cheap-jack b-film a boring chore. I thought it was fair. Anyhow who's the man, Chuck's the man. Not much of an actor though, but we know. He gets by with that golden blonde hair and legendary chop-suey who-ha…. And not forgetting that distinguishable fuzz above the lip. The premise is like an over-extended episode of WALKER TEXAS RANGER meets John Carpenter's HALLOWEEN (1977). Actually a lot scenes and filming techniques closely resemble HALLOWEEN and even its first sequel, but the main difference it's headed by Norrissssssss. The far-fetched concept isn't bad with slasher tones, a lady in peril get-up and a mad scientist theme, but it throws so much in that there seems to be too much useless filler (like the corny romance sequences, biker trouble (nice work in the bar Chuck, but we already know how good you are), scientific moral dilemmas and non-effective comic humour) interrupting what could've been more fun. Silly it is to begin with, but do we want to see Norris romancing, or kicking ass? These redundant acts only slowed it up and got in the way on the main story. What outweighs the film is the weakly lacking script with many clumsy dialogues. Norris even gets time to share some heart-warming advice. Director Michael Millar starts off pretty slowly, but in the second half demonstrates well-shot camera placement and steady pockets of poignant tension. The atmospheric synthesizer score seemed to work. Chuck gets his hands dirty with some gusty scuffles involving the super-human killing machine, like the modest, if unspectacular showdown with him using his jump-kicks (in slow-motion of course) and sudden close-ups to show that focuses on his face. Norris' chimes in with a stoic performance, but goes gusty when the action calls. Brian Libby's menacingly towering figure is effective. Ron Silver sticks out as the humane doctor, while William Finley goes all-smarmy as deceitfully mad doctor looking for that Nobel Prize award. Stephen Furst as the overweight, downright clueless deputy was there for the laughs, but where were they. Toni Kalem looks all-sweet as Norris old flame.",
  "image": "http://cdn.moviestillsdb.com/sm/a5e875727404c8be0b999d643e099bb3/silent-rage.jpg"
}, {
  "author": "Arnold Schwarzenegger",
  "title": "This movie was touched by God!",
  "content": "Did it ever happen in your life that you've seen such a beautiful movie, such a perfect piece of art, such an unbelievable example of man-made splendor, such a gorgeous masterpiece that it hurt your eyes? Well, I did. And it wasn't the Schindler's List or the Lord of the Rings. No, it was the BEST action movie ever made. The BEST interpretation of the Governator. The BEST explosions. The BEST one-liners. The BEST plot. And the BEST tag-line. This movie is like the Art of Japanese gardening. Simple and beautiful. Balanced. Proportioned. There's just the right amount of everything. And there is just about everything that should go into an action movie: car chases, explosions, drug-lords, sex, an invincible hero, sitting-duck-like enemies, humor, knife duels, fist fights, rocket launchers, blood, death, bullets, glass, pectorals, muscles, some more muscles, explosions and more explosions. You need more? It's got Arnold. Need more? It's got Arnold with a sense of humor. Still more? It's got Arnold with a sense of humor and a rocket launcher. Put these three elements together and try to guess what happens. Destruction. On a mass scale. I won't give away the plot, because it is too intricate and surprising. Basically it is Arnie on a mission to save his daughter. That's about it. But what is important is not the fact that Arnie will save his daughter, but HOW will he save his daughter. Oh, are you saying that The Matrix is the best action movie of all time? Does The Matrix have Arnold Schwarzenegger? NO. Does Commando have the Matrix? YES. JOHN MATRIX, in fact. Oh, so you are saying that Neo dodges bullets? John Matrix doesn't need to. He is bulletproof. He eats bullets for breakfast. Need more proof? I thought so... I gave this Caravaggio painted on celluloid a 10 only because IMDb doesn't go to 11. This movie is so eye-blindingly beautiful I can't find the words to properly end my commentary and render justice to this cinematic masterpiece. So I will just use the movie's tag-line: Somewhere... somehow... someone's going to pay!",
  "image": "http://www.ew.com/sites/default/files/styles/tout_image_612x380/public/i/2008/05/02/Commando-Arnold_dl.jpg?itok=FoyXmov9"
}, {
  "author": "Kurt Russell",
  "title": "Its all in the reflexes",
  "content": "Now let me just speak my peace before some of you either laugh at me or totally agree with me but i feel Big Trouble in Little China is one of the greatest movies of all time!! Actually it is my favorite movie of all time!! Yes i know such movies as Saving Private Ryan, Shawshank Redemption, or even Willy Wonka might be looked upon as better movies but i say WHO CARES!!! Big trouble in Little China is a fun movie that you can sit back on a lonely night and just enjoy. The plot is pretty basic and that is why it is easy to follow. Yet the acting of Kurt Russell alone makes the movie. Im not saying this just because i am a BIG KR fan but he just does a wonderful job in this movie as a Truck drive who has no clue on whats going on but just goes with the flow! The witty lines of Kurt Russell in this movie are some of the funniest lines i have ever heard come from an actors mouth.. I mean the whole part of Lo-pan and Jack in the wheelchair is one of the funniest peices of material i have ever seen on the big screen... Well gtg and just remember if some wild 8ft tall monster grabs the back of your favorite head and slams it aganist the bar room wall and ask if you paid your dues!!??! well just tell him what ole jack always says.. Yes sir the check is in the mail",
  "image": "http://www.geeksofdoom.com/GoD/img/2014/02/big-trouble-in-little-china-jack-burton.jpg"
}, {
  "author": "Sylvester Stallone",
  "title": "Where Rambo stops, Cobra begins",
  "content": "With two Rambo movies, First Blood (1982) and Rambo : First Blood part II (1985) under his commando belt, Sylvester Stallone had confidently confirmed himself as the Box Office king of the Action Thriller genre. With all the gingoism and American flag waving that went with the comic strip adventures of the worlds favourite fictional viet nam vet, Stallone steps up a gear into Cobra (1986), one of the tightest, exciting, well written and under-rated action movies of the past few decades. Stallone takes British crime novelette Running Duck from celebrated writer Paula Gossling and gives it the full Rambo gloss treatment. Gone from the novel is the alcoholic schizoid lead character and in his place is Marion Cobretti, the typical, four square Stallone character, and the story is all the better for this. Stallone' screenplay is pretty simple, and so is the under lying message that evil is a force that must be met on its own terms. So what we have is a violent actioneer chock full of punch ups, car chases and shooting. Sadly, the script isn't developed enough, and the Rocky elemnts so typical of Stallone's movies at this point, IE, the underdog hero who everyone is against, is used to the maxim here. Unlike the Rocky movies, the glare of humour isn't up to scratch, and so a great many of the lead characters are unlikeable. So what? Wasn't this the case with thrillers such as Seven or Resovoir Dogs? However, Rambo Director George Pan Cosmatos gives a fresh coat of paint to this particular movie, adding stylish touches of film noir to the action genre in a way that precceeds Face/Off (1997) and a whole host of successors. Bridgette Nielsen is the movies real surprise, giving a likeable and sincere performance as Helgar, under the watchful eye of her then Husband. What is really surprising is that Cosmatos manages to succesfully blend into the action genre touches of classic and contemporary horror movies such as Friday the Thirteenth and John Carpenters Halloween with the chilling depiction of the Night Slashers. The movie also contains some of the most exhilerating action and chase sequences, particularly in the movies climax, where Cobra lets rip unto the Night Slashers men. This is an under-rated gem, a very efficient Stallone/George Pan Cosmatos vehicle, and very possibly the best ever Menahem Golan, Yoram Globus/Cannon Film Group picture ever produced.",
  "image": "https://fixingadivot.files.wordpress.com/2014/06/wake_cobra_thumb.jpg"
  }]
}
